@echo off
chcp 65001
setlocal

where python >nul 2>nul
if %errorlevel% neq 0 (
    echo Ошибка: Python не найден. Убедитесь, что он установлен и добавлен в PATH.
    pause
    exit /b 1
) else (
    echo Python установлен и доступен в PATH.Всё ок!!!
)


echo.
echo " /\_/\  /\_/\  /\_/\  /\_/\  /\_/\  /\_/\  /\_/\  /\_/\  /\_/\  /\_/\ ";
echo "( o.o )( o.o )( o.o )( o.o )( o.o )( o.o )( o.o )( o.o )( o.o )( o.o )";
echo " > ^ <  > ^ <  > ^ <  > ^ <  > ^ <  > ^ <  > ^ <  > ^ <  > ^ <  > ^ < ";
echo " /\_/\               __                                         /\_/\ ";
echo "( o.o )         ____/ /__  ____  __  ___   ______  __/|_       ( o.o )";
echo " > ^ <         / __  / _ \/ __ \/ / / / | / / __ \|    /        > ^ < ";
echo " /\_/\        / /_/ /  __/ / / / /_/ /| |/ / /_/ /_ __|         /\_/\ ";
echo "( o.o )       \__,_/\___/_/ /_/\__,_/ |___/\____/ |/           ( o.o )";
echo " > ^ <                                                          > ^ < ";
echo " /\_/\  /\_/\  /\_/\  /\_/\  /\_/\  /\_/\  /\_/\  /\_/\  /\_/\  /\_/\ ";
echo "( o.o )( o.o )( o.o )( o.o )( o.o )( o.o )( o.o )( o.o )( o.o )( o.o )";
echo " > ^ <  > ^ <  > ^ <  > ^ <  > ^ <  > ^ <  > ^ <  > ^ <  > ^ <  > ^ < ";
echo.

pause
endlocal
